Console.WriteLine("Написать программу, которая из имеющегося массива строк" +
" формирует массив из строк, длина которых меньше либо равна 3 символа." +
" Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.");

string UserInput = "";

Console.WriteLine("Введите ваш текст сюда:");
UserInput = Console.ReadLine() ?? "";

